In [3]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect

In [4]:
# Create engine using the `postgresql` database file
engine = create_engine('postgresql://postgres:postgres@localhost:5433/sql-challenge_db')

inspector = inspect(engine)

In [5]:
inspector.get_table_names()

['titles',
 'employees',
 'dept_employees',
 'departments',
 'dept_manager',
 'salaries']

In [6]:
# Declare the Base to reflect the db tables
Base=automap_base()
Base.prepare(engine,reflect=True)
Base.classes.keys()

['titles', 'employees', 'departments', 'salaries']

In [8]:
titles = Base.classes.titles
employees = Base.classes.employees
departments = Base.classes.departments
salaries = Base.classes.salaries
#ept_employees = Base.classes.dept_employees
#ept_manager = Base.classes.dept_manager

In [22]:
session = Session(engine)

In [23]:
sal_cols = inspector.get_columns("salaries")
print(sal_cols)
print()

emp_cols = inspector.get_columns("employees")
print(emp_cols)
print()

title_cols = inspector.get_columns("titles")
print(title_cols)
print()

[{'name': 'emp_no', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'salary', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}]

[{'name': 'emp_no', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'emp_title_id', 'type': VARCHAR(length=10), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'birth_date', 'type': DATE(), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'first_name', 'type': VARCHAR(length=50), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'last_name', 'type': VARCHAR(length=50), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'sex', 'type': VARCHAR(length=3), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'hire_date', 'type': DATE(), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}]

[{'name': 'title_id', 'type': VARCHAR(length=10), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'title', 'type': VARCHAR(length=50), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}]

In [34]:
import pandas as pd
employee_list = engine.execute('SELECT * from employees').fetchall()
employee_df = pd.DataFrame(employee_list, columns =['emp_no','emp_title_id','birth_date','first_name','last_name','sex','hire_date'])
employee_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [36]:
titles_list = engine.execute('SELECT * from titles').fetchall()
titles_df = pd.DataFrame(titles_list, columns = ['title_id','title'])
titles_df.head()

    title_id               title
0  ﻿title_id               title
1      s0001               Staff
2      s0002        Senior Staff
3      e0001  Assistant Engineer
4      e0002            Engineer

In [38]:
salary_list = engine.execute('SELECT * from salaries').fetchall()
salary_df = pd.DataFrame(salary_list, columns = ['emp_no','salary'])
salary_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [30]:
results = session.query(salaries.emp_no, salaries.salary).order_by(salaries.salary.desc()).limit(10).all()
print(results)
print()
print(results[0])

[(205000, 129492), (44188, 127238), (444756, 127041), (458302, 126703), (37558, 125469), (296857, 124357), (20004, 123749), (109334, 123668), (474456, 123477), (474684, 122726)]

(205000, 129492)

In [ ]:
for result in results:
    print(result[0])